Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: It applies the new correction to the word under the cursor.
es_es: Aplica la nueva corrección a la palabra bajo el cursor.

source: The |:normal| command is used to use the new abbreviation.
es_es: La orden |:normal| se emplea para usar la nueva abreviatura.

source: Note that mappings and abbreviations are expanded here, even though the function was called from a mapping defined with ":noremap".
es_es: Tenga en cuenta que aquí se expanden las macros y abreviaturas, a pesar de que la función se ha invocado desde una macro definida con «:noremap».

source: Using "unix" for the 'fileformat' option is recommended.
es_es: Se recomienda usar «unix» como valor para la opción 'fileformat'.

source: The Vim scripts will then work everywhere.
es_es: De esta forma, los scripts de Vim funcionarán en cualquier sistema.

source: Scripts with 'fileformat' set to "dos" do not work on Unix.
es_es: Los scripts con 'fileformat' definido como «dos» no funcionarán en Unix.

source: Also see |:source_crnl|.
es_es: También puede consultar |:source_crnl|.

source: To be sure it is set right, do this before writing the file: >
es_es: Para asegurar que hace lo correcto, haga lo siguiente antes de escribir el archivo: >

source: 1 *typecorr.txt* Plugin for correcting typing mistakes 2 3 If you make typing mistakes, this plugin will have them corrected 4 automatically.
es_es: 1 *correcort.txt* Una extensión para corregir errores ortográficos 2 3 Esta extensión corrige automáticamente cualquier error ortográfico 4 que pueda escribir.

source: 5 6 There are currently only a few corrections.
es_es: 5 6 Solo hay unas pocas correcciones.

source: Add your own if you like.
es_es: Puede añadir las suyas.

source: 7 8 Mappings: 9 <Leader>a or <Plug>TypecorrAdd 10 Add a correction for the word under the cursor.
es_es: 7 8 Macros: 9 <Leader>a o <Plug>CorreccortAñadir 10 Añade una corrección para la palabra bajo el cursor.

source: 11 12 Commands: 13 :Correct {word} 14 Add a correction for {word}.
es_es: 11 12 Órdenes: 13 :Corregir {palabra} 14 Añade una corrección para {palabra}.

source: 15 16 *typecorr-settings* 17 This plugin doesn't have any settings.
es_es: 15 16 *correcort-opciones* 17 Esta extensión no tiene opciones de configuración.

source: The first line is actually the only one for which the format matters.
es_es: En realidad, la primera línea es la única en la que el formato importa.

source: It will be extracted from the help file to be put in the "LOCAL ADDITIONS:" section of help.txt |local-additions|.
es_es: Se extraerá del archivo de ayuda para su ubicación en la sección «LOCAL ADDITIONS:» de help.txt |local-additions|.

source: The first "*" must be in the first column of the first line.
es_es: El primer asterisco debe estar en la primera columna de la primera línea.

source: After adding your help file do ":help" and check that the entries line up nicely.
es_es: Ejecute «:help» después de añadir su archivo de ayuda y compruebe que las entradas están alineadas adecuadamente.

source: Using references to other parts of the help in || is recommended.
es_es: Se recomienda utilizar referencias a otras partes de archivos de ayuda mediante barras, ||.

source: This makes it easy for the user to find associated help.
es_es: Esto facilita que el usuario encuentre ayuda relacionada.

source: If your filetype is not already detected by Vim, you should create a filetype detection snippet in a separate file.
es_es: Si Vim no detecta su tipo de archivo, debería crear un fragmento de código de detección de tipo de archivo en un archivo separado.

source: It is usually in the form of an autocommand that sets the filetype when the file name matches a pattern.
es_es: Habitualmente, tiene la forma de una orden automática que define el tipo de archivo cuando su nombre concuerda con un patrón.

source: Write this single-line file as "ftdetect/foofoo.vim" in the first directory that appears in 'runtimepath'.
es_es: Escriba este archivo de una sola línea como «ftdetect/foofoo.vim» en el primer directorio que aparece en su 'runtimepath'.

source: For Unix that would be "~/.vim/ftdetect/foofoo.vim".
es_es: En Unix, sería «~/.vim/ftdetect/foofoo.vim».

source: The convention is to use the name of the filetype for the script name.
es_es: La convención es nombrar el script como el nombre del tipo de archivo.

source: You can make more complicated checks if you like, for example to inspect the contents of the file to recognize the language.
es_es: Si lo desea, puede hacer comprobaciones más complejas como inspeccionar los contenidos de un archivo para reconocer el tipo del mismo.

source: Also see |new-filetype|.
es_es: Consulte también |new-filetype|.

source: A filetype plugin is like a global plugin, except that it sets options and defines mappings for the current buffer only.
es_es: Una extensión de tipo de archivo («filetype plugin») es como una extensión global, a diferencia de que define opciones y macros que solo afectan al búfer local.

source: See |add-filetype-plugin| for how this type of plugin is used.
es_es: Para saber más acerca del uso de este tipo de extensión, consulte |add-filetype-plugin|.

source: First read the section on global plugins above |41.11|.
es_es: En primer lugar, consulte la sección anterior sobre extensiones globales, |41.11|.

source: All that is said there also applies to filetype plugins.
es_es: Todo lo detallado ahí también afecta a las extensiones de tipo de archivo.

source: There are a few extras, which are explained here.
es_es: Hay algunos elementos adicionales, que se explican aquí.

source: The essential thing is that a filetype plugin should only have an effect on the current buffer.
es_es: Lo esencial es que una extensión de tipo de archivo sólo debe tener efecto en el búfer actual.

source: If you are writing a filetype plugin to be used by many people, they need a chance to disable loading it.
es_es: Si esta escribiendo una extensión de tipo de archivo que mucha gente usará, necesitarán la capacidad de desactivar su carga.

source: Put this at the top of the plugin: >
es_es: Inserte lo siguiente al principio de la extensión: >

source: Now write this in the "after" directory, so that it gets sourced after the distributed "vim.vim" ftplugin |after-directory|.
es_es: Escriba esto en el directorio «after», para que se lea después de la extensión de tipo de archivo predeterminado distribuido, «vim.vim» |after-directory|.

source: For Unix this would be "~/.vim/after/ftplugin/vim.vim".
es_es: En sistemas Unix, sería «~/.vim/after/ftplugin/vim.vim».

source: Note that the default plugin will have set "b:did_ftplugin", but it is ignored here.
es_es: Tenga en cuenta que la extensión predeterminada habrá definido «b:did_ftplugin», pero aquí se ignora.

source: When an option has a value that is a list of flags or items, consider using "+=" and "-=" to keep the existing value.
es_es: Cuando una opción tiene un valor que es una lista de opciones o elementos, considere usar «+=» y «-=» para conservar el valor existente.

source: Be aware that the user may have changed an option value already.
es_es: Sea consciente de que puede que el usuario ya haya cambiado el valor de una opción.

source: First resetting to the default value and then changing it often a good idea.
es_es: Es una buena idea restablecer el valor original y después cambiarlo.

source: |hasmapto()| is used to check if the user has already defined a map to <Plug>JavaImport.
es_es: |hasmapto()| sirve para comprobar si el usuario ya ha definido una macro para «<Plug>JavaImport».

source: If not, then the filetype plugin defines the default mapping.
es_es: Si no ha sido definida, la extensión de tipo de archivo define la macro actual.

source: This starts with |<LocalLeader>|, which allows the user to select the key(s) he wants filetype plugin mappings to start with.
es_es: Esta empieza con |<LocalLeader>|, que permite al usuario seleccionar una o mas teclas con las que iniciar las macros de la extensión de tipo de archivo.

source: The default is a backslash.
es_es: El valor predeterminado es una barra inversa, «\».

source: "<unique>" is used to give an error message if the mapping already exists or overlaps with an existing mapping.
es_es: «<unique>» sirve para emitir un mensaje de error si la macro ya existe o entra en conflicto con otra.

source: |:noremap| is used to avoid that any other mappings that the user has defined interferes.
es_es: |:noremap| sirve para evitar que las macros definidas por el usuario interfieran.

source: You might want to use ":noremap <script>" to allow remapping mappings defined in this script that start with <SID>.
es_es: Puede que desee usar «:noremap <script>» para permitir redefinir macros en el script que comienza con <SID>.

source: The user must have a chance to disable the mappings in a filetype plugin, without disabling everything.
es_es: Tiene que ofrecer al usuario la opción de desactivar macros en una extensión de tipo de archivo, sin desactivar el resto.

source: Here is an example of how this is done for a plugin for the mail filetype: >
es_es: Aquí tiene un ejemplo de como hacerlo con una extensión para el tipo de archivo mail: >

source: " Add mappings, unless the user didn't want this.
es_es: " Añade macros, a menos que el usuario defina lo contrario.

source: if !exists("no_plugin_maps") && !exists("no_mail_maps") " Quote text by inserting "> " if !hasmapto('<Plug>MailQuote') vmap <buffer> <LocalLeader>q <Plug>MailQuote nmap <buffer> <LocalLeader>q <Plug>MailQuote endif vnoremap <buffer> <Plug>MailQuote :s/^/> /<CR> nnoremap <buffer> <Plug>MailQuote :.,$s/^/> /<CR> endif
es_es: if !exists("no_plugin_maps") && !exists("no_mail_maps") " Cita el texto insertando «> » if !hasmapto('<Plug>MailQuote') vmap <buffer> <LocalLeader>q <Plug>MailQuote nmap <buffer> <LocalLeader>q <Plug>MailQuote endif vnoremap <buffer> <Plug>MailQuote :s/^/> /<CR> nnoremap <buffer> <Plug>MailQuote :.,$s/^/> /<CR> endif

source: To add a user command for a specific file type, so that it can only be used in one buffer, use the "-buffer" argument to |:command|.
es_es: El argumento «-buffer» de |:command| permite añadir una orden de usuario para un tipo de archivo específico y que solo afecta al búfer local.

source: When defining a function, this only needs to be done once.
es_es: Cada función necesita ser definida una sola vez.

source: But the filetype plugin will be sourced every time a file with this filetype will be opened.
es_es: Pero la extensión de tipo de archivo se cargará cada vez que se abra un archivo del tipo correspondiente.

source: This construct makes sure the function is only defined once: >
es_es: Esta estructura asegura que la función se defina una sola vez: >

source: When the user does ":setfiletype xyz" the effect of the previous filetype should be undone.
es_es: Cuando el usuario hace «:setfiletype xyz», el efecto del tipo de archivo anterior debería desaparecer.

source: Set the b:undo_ftplugin variable to the commands that will undo the settings in your filetype plugin.
es_es: Defina la variable «b:undo_ftplugin» con las órdenes que deshacen los cambios de configuración de su extensión de tipo de archivo.

source: Using ":setlocal" with "<" after the option name resets the option to its global value.
es_es: Usar «:setlocal» con «<» después del nombre de la opción restablece la opción a su valor global.

source: That is mostly the best way to reset the option value.
es_es: Habitualmente, es la mejor forma de restablecer el valor de una opción.

source: The filetype must be included in the file name |ftplugin-name|.
es_es: El nombre del archivo debe incluir el tipo de archivo |ftplugin-name|.

source: Use one of these three forms:
es_es: Puede usar una de las tres formas a continuación:

source: A compiler plugin sets options for use with a specific compiler.
es_es: Una extensión de compilador define opciones a usar con un compilador específico.

source: The user can load it with the |:compiler| command.
es_es: El usuario puede cargarlo con la orden |:compiler|.

source: The main use is to set the 'errorformat' and 'makeprg' options.
es_es: El uso principal es definir las opciones 'errorformat' y 'makeprg'.

source: Easiest is to have a look at examples.
es_es: Lo más sencillo es ver unos ejemplos.

source: This command will edit all the default compiler plugins: >
es_es: Esta orden editará todas las extensiones de compilador predeterminadas: >

source: There are two special items about these files.
es_es: Hay dos aspectos a tener en cuenta con estas extensiones.

source: First is a mechanism to allow a user to overrule or add to the default file.
es_es: En primer lugar, deben contar con un mecanismo que permita al usuario anular o añadir cambios a la extensión.

source: The default files start with: >
es_es: Las extensiones predeterminadas comienzan con: >

source: When you write a compiler file and put it in your personal runtime directory (e.g., ~/.vim/compiler for Unix), you set the "current_compiler" variable to make the default file skip the settings.
es_es: Cuando escribe un archivo de compilador, y lo ubica en su directorio de ejecución personal (esto es, «~/.vim/compiler» en sistemas Unix), debe definir la variable «current_compiler» para que la extensión de compilador predeterminada evite hacer cambios en la configuración.

source: *:CompilerSet* The second mechanism is to use ":set" for ":compiler!" and ":setlocal" for ":compiler".
es_es: *:CompilerSet* El segundo mecanismo es usar «:set» con «:compiler!», y «:setlocal» con «:compiler».

source: Vim defines the ":CompilerSet" user command for this.
es_es: Para ello, Vim define la orden de usuario «:CompilerSet».

source: However, older Vim versions don't, thus your plugin should define it then.
es_es: Por otra parte, las versiones anteriores de Vim no cuentan de ella, y por ello su extensión debe definirlo.

source: This is an example: >
es_es: Aquí tiene un ejemplo: >

source: When you write a compiler plugin for the Vim distribution or for a system-wide runtime directory, use the mechanism mentioned above.
es_es: Use el mecanismo mostrado aquí cuando escriba una extensión de compilador para la distribución Vim o para un directorio de tiempo de ejecución del sistema.

source: When "current_compiler" was already set by a user plugin nothing will be done.
es_es: No se hará nada si «current_compiler» ya está definido por una extensión de usuario.

source: When you write a compiler plugin to overrule settings from a default plugin, don't check "current_compiler".
es_es: Cuando escribe una extensión de compilador para cambiar las opciones definidas por una extensión predeterminada, evite comprobar «current_compiler».

source: This plugin is supposed to be loaded last, thus it should be in a directory at the end of 'runtimepath'.
es_es: Esta extensión se debería cargar al final, y por ello debería estar en un directorio al final de 'runtimepath'.

source: For Unix that could be ~/.vim/after/compiler.
es_es: En sistemas Unix, podría ser «~/.vim/after/compiler».

source: A plugin may grow and become quite long.
es_es: Puede que una extensión crezca, y que sea demasiado larga.

source: The startup delay may become noticeable, while you hardly ever use the plugin.
es_es: Puede que el tiempo de carga empiece a hacerse notorio, y además, que usted apenas use la extensión.

source: Then it's time for a quickload plugin.
es_es: En este caso, hay que usar una extensión de carga rápida («quickload»).

source: The basic idea is that the plugin is loaded twice.
es_es: La idea principal es que la extensión se carga dos veces.

source: The first time user commands and mappings are defined that offer the functionality.
es_es: La primera vez, se definen las órdenes de usuario y macros que ofrecen la funcionalidad de la extensión.

source: The second time the functions that implement the functionality are defined.
es_es: La segunda vez, se definen las funciones que implementan tales funcionalidades.

source: It may sound surprising that quickload means loading a script twice.
es_es: Puede que sorprenda que «carga rápida» signifique cargar una extensión dos veces.

source: What we mean is that it loads quickly the first time, postponing the bulk of the script to the second time, which only happens when you actually use it.
es_es: Lo que queremos decir es que se carga rápidamente la primera, demorando la carga de la mayoría de la extensión a la segunda vez, lo que sólo ocurre cuando realmente la usa.

source: When you always use the functionality it actually gets slower!
es_es: ¡Si usa siempre la funcionalidad que provee la extensión, no obtendrá ninguna ventaja!

source: ')' " read functionality here endfunction
es_es: ')' " Funcionalidad de lectura aquí endfunction

source: ')' " write functionality here endfunction
es_es: ')' " Funcionalidad de escritura aquí endfunction

source: The second time the script is loaded "s:did_load" exists and the commands after the "endif" are executed.
es_es: La segunda vez que se carga, «s:did_load» existe y se ejecutan las órdenes después de «endif».

source: This defines the (possible long) BufNetRead() and BufNetWrite() functions.
es_es: Esto define las (posiblemente largas) funciones BufNetRead() y BufNetWrite().

source: If you drop this script in your plugin directory Vim will execute it on startup.
es_es: Si ubica este script en su directorio «plugin», Vim lo ejecutará al inicio.

source: This is the sequence of events that happens:
es_es: A continuación la secuencia de los eventos:

source: The "BNRead" command is defined and the <F19> key is mapped when the script is sourced at startup.
es_es: Se define la orden «BNRead» y la tecla <F19> se asigna a una macro al cargar el script al inicio.

source: A |FuncUndefined| autocommand is defined.
es_es: Se define una orden automática |FuncUndefined|.

source: The ":finish" command causes the script to terminate early.
es_es: La orden «:finish» hace que el script finalice antes.

source: The user types the BNRead command or presses the <F19> key.
es_es: El usuario introduce la orden «BNRead» o pulsa la tecla <F19>.

source: The BufNetRead() or BufNetWrite() function will be called.
es_es: Se invoca la función «BufNetRead()» o «BufNetWrite()».

source: Vim can't find the function and triggers the |FuncUndefined| autocommand event.
es_es: Vim no puede encontrar la función y ejecuta la orden automática |FuncUndefined|.

source: Since the pattern "BufNet*" matches the invoked function, the command "source fname" will be executed.
es_es: Ya que el patrón «BufNet*» coincide con la función invocada, se ejecutará la orden «source nombre-archivo».

source: "fname" will be equal to the name of the script, no matter where it is located, because it comes from expanding "<sfile>" (see |expand()|).
es_es: «nombre-archivo» debe ser igual al nombre del script, sin importar su ubicación, ya que procede de expandir «<sfile>» (consulte |expand()|).

source: The script is sourced again, the "s:did_load" variable exists and the functions are defined.
es_es: El script se carga otra vez, la variable «s:did_load» existe, y se definen las funciones.

source: Notice that the functions that are loaded afterwards match the pattern in the |FuncUndefined| autocommand.
es_es: Tenga en cuenta que las funciones se cargan después de comparar el patrón en la orden automática |FuncUndefined|.

source: You must make sure that no other plugin defines functions that match this pattern.
es_es: Debe comprobar que ninguna otra extensión define funciones que coincidan con este patrón.

source: Some functionality will be required in several places.
es_es: Algunas funcionalidades son necesarias en varios lugares.

source: When this becomes more than a few lines you will want to put it in one script and use it from many scripts.
es_es: Cuando se trata de algo más que unos pocas líneas, querrá ubicarlo en un script, y usarlo desde varios otros.

source: We will call that one script a library script.
es_es: Vamos a denominar ese script como biblioteca.

source: Manually loading a library script is possible, so long as you avoid loading it when it's already done.
es_es: Cargar una biblioteca manualmente es posible, siempre que evite cargarla cuando ya lo está.

source: You can do this with the |exists()| function.
es_es: Puede evitarlo con la función |exists()|.

source: To make this a bit simpler Vim offers the autoload mechanism.
es_es: Para hacer esto más sencillo, Vim ofrece el mecanismo «autoload» (carga automática).

source: Then the example looks like this: >
es_es: Así, el ejemplo tendría este aspecto: >

source: That's a lot simpler, isn't it?
es_es: Mucho más sencillo, ¿verdad?

source: Vim will recognize the function name and when it's not defined search for the script "autoload/mylib.vim" in 'runtimepath'.
es_es: Vim reconoce el nombre de la función y, cuando no esté definida, la buscará el script «autoload/mibiblioteca.vim» en 'runtimepath'.

source: That script must define the "mylib#myfunction()" function.
es_es: El script debe definir la función «mibiblioteca#mifuncion()».

source: You can put many other functions in the mylib.vim script, you are free to organize your functions in library scripts.
es_es: Puede almacenar varias funciones en el script mibiblioteca.vim, y puede organizar como desee las funciones en sus bibliotecas.

source: But you must use function names where the part before the '#' matches the script name.
es_es: Pero debe usar nombres de funciones en las que la parte que precede a «#» coincide con el nombre del script.

source: Otherwise Vim would not know what script to load.
es_es: En caso contrario, Vim no sabrá qué script cargar.

source: If you get really enthusiastic and write lots of library scripts, you may want to use subdirectories.
es_es: Si esto le entusiasma, y escribe muchas bibliotecas, puede que quiera usar subdirectorios.

source: Notice that the name the function is defined with is exactly the same as the name used for calling the function.
es_es: Tenga en cuenta que el nombre con el que se define la función es idéntico al utilizado para invocar la función.

source: And the part before the last '#' exactly matches the subdirectory and script name.
es_es: Y la parte a continuación del último «#» coincide con el subdirectorio y el nombre del script.

source: Vim users will look for scripts on the Vim website: http://www.vim.org.
es_es: Los usuarios de Vim buscarán scripts en el sitio web de Vim: http://www.vim.org.

source: If you made something that is useful for others, share it!
es_es: Si ha creado algo útil para otros, ¡compártalo!

source: Vim scripts can be used on any system.
es_es: Los scripts de Vim se pueden usar en cualquier sistema.

source: There might not be a tar or gzip command.
es_es: Las órdenes tar o gzip pueden no estar disponibles en dichos sistemas.

source: If you want to pack files together and/or compress them the "zip" utility is recommended.
es_es: Si desea empaquetar o comprimir los archivos, se recomienda usar la herramienta «zip».

source: For utmost portability use Vim itself to pack scripts together.
es_es: Para obtener la máxima portabilidad use Vim para empaquetar los scripts.

source: This can be done with the Vimball utility.
es_es: Puede hacer esto con la herramienta Vimball.

source: See |vimball|.
es_es: Consulte |vimball|.

source: It's good if you add a line to allow automatic updating.
es_es: Es una buena idea añadir una línea para pemitir la actualización automática.

source: See |glvs-plugins|.
es_es: Consulte |glvs-plugins|.

source: *usr_30.txt* For Vim version 7.3.
es_es: *usr_30.esx* Para Vim versión 7.3.

source: Last change: 2007 Nov 10
es_es: Último cambio: 10/11/2007
